[
  {
    "name": "UserConfigurationRequestedMessage",
    "type": "HTML",
    "template": "Upload a ZIP archive with extended configuration files\n\nIf you're unsure about the configuration or where to find an example, a detailed description can be found in the advanced settings"
  },
  {
    "name": "UserConfigurationSubmittedMessage",
    "type": "HTML",
    "template": "Settings saved. They will be applied during book conversion\n\nIf there's an STK section in the configuration, it will also be considered"
  },
  {
    "name": "UserConfigurationRemovedMessage",
    "type": "HTML",
    "template": "Configuration removed. Default settings will be applied during file conversion\n\nAfter converting the book, you can still send them to your E-Mail."
  },
  {
    "name": "FileUploadFailedMessage",
    "type": "HTML",
    "template": "${reason}"
  },
  {
    "name": "FileConvertationRequestedMessage",
    "type": "HTML",
    "template": "File is being converted, it will be ready soon"
  },
  {
    "name": "FileConvertarionSuccessMessage",
    "type": "HTML",
    "template": "Conversion was successful\n\nFiles can be downloaded anytime or sent to the configured E-Mail within 24 hours"
  },
  {
    "name": "FileConvertarionFailedMessage",
    "type": "HTML",
    "template": "Something went wrong during the conversion. Here are the details:\n\n<pre>${details}</pre>\n\nIf you're unsure what to do, contact @maxgrakov"
  },
  {
    "name": "UserConfigurationValidationFailedMessage",
    "type": "HTML",
    "template": "It seems the configuration file contains errors:\n\n${reason}\n\nIf you're unsure about the configuration or where to find an example, check the advanced settings section"
  },
  {
    "name": "UserConfigurationSubmissionFailedMessage",
    "type": "HTML",
    "template": "Something went wrong while processing the settings file. Please contact @maxgrakov"
  },
  {
    "name": "MainScreenRequestedMessage",
    "type": "HTML",
    "template": "Kindle Sideload Tool\n\n<pre>Author: @maxgrakov</pre>\n\nThis is an unofficial way to upload books in fb2 format to Amazon Kindle without losing quality.\n\nClick the \"Convert Book\" button and upload the file"
  },
  {
    "name": "SettingsScreenRequestedMessage",
    "type": "HTML",
    "template": "Here you can configure the conversion and file sending parameters"
  },
  {
    "name": "ConversationPromptMessage",
    "type": "HTML",
    "template": "Upload a book in fb2 format to convert it into a Kindle-compatible format"
  },
  {
    "name": "ProjectInfoMessage",
    "type": "HTML",
    "enablePreview": "false",
    "template": "Unfortunately, Kindle reading devices do not support FB2, and most EPUB files from bookstores are converted by Amazon services with significant losses\n\nI created this service to solve both problems at once:\n\nnow you can quickly get quality converted books on Kindle, with preserved page layout, margins, indents, and fonts\n\nI tried to make the service's use not too different from using the official Kindle app from Google Play or App Store, and I hope I succeeded\n\nThe service will remain free and available to all users without restrictions as long as possible\n\n___\n\nThe project uses the <a href=\"https://github.com/rupor-github/fb2converter\">fb2converter</a> under the GPL-3.0 license, and I would like to thank the author for his work\n\nThe service is distributed under the MIT license, the source codes are available <a href = \"https://github.com/GrakovNe/kindle-sideload/\">here</a>\n\n___\n\nPlease use the service for good and do not deprive authors of the opportunity to earn from their books\n\nIf you want to support the service, contact @maxgrakov and we'll find a way\n\nSincerely, Max Grakov"
  },
  {
    "name": "AdvancedConfigurationMessage",
    "type": "HTML",
    "template": "Here you can upload an archive with book settings.\n\nThis will allow you to modify parameters such as font, margins, and more.\n\nThe \"STK\" section will also be applied if it's correctly configured."
  },
  {
    "name": "ConverterDefaultConfigurationMessage",
    "type": "HTML",
    "template": "A file with the default configuration has been sent.\n\nIt contains basic parameters that are easy to customize. Upload the modified file back after making changes."
  },
  {
    "name": "DebugSettingsMessage",
    "type": "HTML",
    "template": "Here you can enable or disable detailed conversion reports.\n\nThis might be useful for configuration debugging."
  },
  {
    "name": "DisableDebugSettingsMessage",
    "type": "HTML",
    "template": "Detailed reports are disabled."
  },
  {
    "name": "EnableDebugSettingsMessage",
    "type": "HTML",
    "template": "Detailed reports are enabled."
  },
  {
    "name": "OutputTypeSettingsMessage",
    "type": "HTML",
    "template": "Here you can choose the format you want to receive the file in after conversion."
  },
  {
    "name": "SetOutputTypeMessage",
    "type": "HTML",
    "template": "File format has been set."
  },
  {
    "name": "StkScreenMessage",
    "type": "HTML",
    "template": "Here you can configure the sending of books to E-Mail after conversion."
  },
  {
    "name": "UpdateEmailUpdatedMessage",
    "type": "HTML",
    "enablePreview": "false",
    "template": "The E-Mail to which files will be sent after conversion has been updated. Click the \"Send to email\" button to receive the files.\n\nDon't forget to add the E-Mail sideload@grakovne.org to the trusted list so that books arrive automatically.\n\nYou can read more about how to do this here: \n\nhttps://www.amazon.com/gp/help/customer/display.html?nodeId=GX9XLEVV8G4DB28H"
  },
  {
    "name": "UpdateEmailPromptMessage",
    "type": "HTML",
    "template": "Send the E-Mail to which you want to receive books after conversion. After that, don't forget to set it up on the reading device."
  },
  {
    "name": "StkSuccessMessage",
    "type": "HTML",
    "template": "Files have been sent to E-Mail. Their processing by Kindle services may take some time."
  },
  {
    "name": "StkFailedMessage",
    "type": "HTML",
    "template": "Something went wrong, and the files couldn't be sent to E-Mail. If you didn't set E-Mail yet, it could be done in the Settings\n\nIf E-Mail set already, please contact @maxgrakov."
  },
  {
    "name": "StkSubmittedMessage",
    "type": "HTML",
    "template": "Sending. Everything will be ready in a few seconds."
  }
]